#include "pch.h"
#include "Component_MapObject.h"
#include "Component_Health.h"
#include "Component_RigidBody.h"
#include "ConstantMapData.h"
#include "BuildingStateFactory.h"

using namespace Map;

//*---------------------------------------------------------------------------------------
//*【?】コンストラクタ
//*----------------------------------------------------------------------------------------
MapObject::MapObject(std::weak_ptr<GameObject> pOwner, int updateRank) :
	IComponent(pOwner, updateRank)
{
}
//*---------------------------------------------------------------------------------------
//*【?】デストラクタ
//*----------------------------------------------------------------------------------------
MapObject::~MapObject()
{
}

//*---------------------------------------------------------------------------------------
//*【?】初期化
//* 
//* [引数]
//* &renderer : 描画エンジンの参照
//* [返値]なし
//*----------------------------------------------------------------------------------------
void MapObject::Start(RendererEngine& renderer)
{

}

//*---------------------------------------------------------------------------------------
//*【?】更新
//*
//* [引数]
//* &renderer : 描画エンジンの参照
//* [返値]なし
//*----------------------------------------------------------------------------------------
void MapObject::Update(RendererEngine& renderer)
{

}


//*---------------------------------------------------------------------------------------
//*【?】衝突処理
//*
//* [引数]
//* &_other : 衝突相手の情報
//* [返値]なし
//*----------------------------------------------------------------------------------------
void MapObject::OnCollisionEnter(const PhysicsData::CollisionInfo& _other)
{

}
