#include "pch.h"
#include "Component_Health.h"
#include "RendererEngine.h"
#include "GameObject.h"

using namespace GIGA_Engine;
using namespace VECTOR3;

//*---------------------------------------------------------------------------------------
//*【?】コンストラクタ
//* [引数]
//* pOwner : オーナーオブジェクト
//* updateRank : 更新レイヤー
//*----------------------------------------------------------------------------------------
Health::Health(std::weak_ptr<GameObject> pOwner, int updateRank)
    :IComponent(pOwner, updateRank),
    m_CrntHP(0.0f),
    m_MaxHP(0.0f),
    m_DamageAmount(0.0f),
    m_IsDead(false)/*,
    m_IsOnDamage(false)*/
{
    this->set_Tag("Health");
}

//*---------------------------------------------------------------------------------------
//*【?】デストラクタ
//*----------------------------------------------------------------------------------------
Health::~Health()
{

}

//*---------------------------------------------------------------------------------------
//*【?】初期化
//*
//* [引数]
//* &renderer : 描画エンジンの参照
//* [返値]なし
//*----------------------------------------------------------------------------------------
void Health::Start(RendererEngine& renderer)
{
}


//*---------------------------------------------------------------------------------------
//*【?】更新
//*
//* [引数]
//* &renderer : 描画エンジンの参照
//* [返値]なし
//*----------------------------------------------------------------------------------------
void Health::Update(RendererEngine& renderer)
{

}

//*---------------------------------------------------------------------------------------
//*【?】ダメージ処理
//*
//* [引数]
//* _dmg : ダメージ値
//*
//* [返値]
//* なし 
//*----------------------------------------------------------------------------------------
void Health::TakeDamage(const float _dmg)
{
    if (m_IsDead){
        return;
    }

    m_CrntHP -= _dmg;
    
    // ダメージ処理を行う
    for (auto& callback : m_DamageTasks) {
        callback(_dmg);
    }

    // 死亡
    if (m_CrntHP <= 0.0f){
        m_CrntHP = 0.0f;
        m_IsDead = true;


        // 死亡処理を行う
        for (auto& callback : m_DeathTasks) {
            callback();
        }
    }
}

//*---------------------------------------------------------------------------------------
//*【?】ダメージ処理（衝突情報格納ver）
//*
//* [引数]
//* _dmg : ダメージ値
//* _collInfo : 衝突情報
//*
//* [返値]
//* なし 
//*----------------------------------------------------------------------------------------
void Health::TakeDamage(const float _dmg, const PhysicsData::CollisionInfo& _collInfo)
{
    if (m_IsDead) {
        return;
    }

    m_CrntHP -= _dmg;

    m_DamageAmount = _dmg;

    // 衝突情報を格納
	m_CollisionInfo = _collInfo;

    // ダメージ処理を行う
    for (auto& callback : m_DamageTasks) {
        callback(_dmg);
    }

    // 死亡
    if (m_CrntHP <= 0.0f) {
        m_CrntHP = 0.0f;
        m_IsDead = true;


        // 死亡処理を行う
        for (auto& callback : m_DeathTasks) {
            callback();
        }
    }
}


//*---------------------------------------------------------------------------------------
//*【?】死んだ際のコールバックを登録
//*
//* [引数]
//* _callback : 引数なし関数
//*
//* [返値]
//* なし 
//*----------------------------------------------------------------------------------------
void Health::RegisterOnDead(std::function<void()> _callback)
{
    m_DeathTasks.push_back(_callback);
}


//*---------------------------------------------------------------------------------------
//*【?】ダメージを受けた際のコールバックを登録
//*
//* [引数]
//* _callback : 引数にfloat（ダメージ値）指定
//*
//* [返値]
//* なし 
//*----------------------------------------------------------------------------------------
void Health::RegisterOnDamage(std::function<void(float)> _callback)
{
    m_DamageTasks.push_back(_callback);
}

//*---------------------------------------------------------------------------------------
//*【?】パラメータなどのリセット
//*
//* [引数] なし
//* [返値] なし
//*----------------------------------------------------------------------------------------
void Health::Reset()
{
    m_IsDead = false;
    m_CrntHP = 0.0f;
    m_MaxHP = 0.0f;
}

//*---------------------------------------------------------------------------------------
//*【?】現在のHP設定
//*
//* [引数] 
//* _hp : 設定するHP 
//* [返値] なし
//*----------------------------------------------------------------------------------------
void Health::set_CrntHP(const float _hp)
{
    m_CrntHP = std::clamp(_hp, 0.0f, m_MaxHP);
}

//*---------------------------------------------------------------------------------------
//*【?】HP回復
//*
//* [引数] 
//* _hp : 設定するHP 
//* [返値] なし
//*----------------------------------------------------------------------------------------
void Health::set_RecoveryHP(const float _hp)
{
    m_CrntHP = std::clamp(m_CrntHP + _hp, 0.0f, m_MaxHP);
}