#include "pch.h"
#include "MapManager.h"

using namespace Map;

//*---------------------------------------------------------------------------------------
//*【?】コンストラクタ
//*----------------------------------------------------------------------------------------
MapManager::MapManager()
{
}

//*---------------------------------------------------------------------------------------
//*【?】デストラクタ
//*----------------------------------------------------------------------------------------
MapManager::~MapManager()
{
}

//*---------------------------------------------------------------------------------------
//*【?】マップデータの読み込み
//*
//* [引数]
//* _filePath : マップデータJsonのファイルパス
//*
//* [返値]
//* true : 成功
//* false : 失敗
//*----------------------------------------------------------------------------------------
bool MapManager::LoadMapData(const std::string& _filePath)
{
    using json = nlohmann::json;
    std::ifstream ifs(_filePath);
    if (!ifs.is_open()) return false;

    json j;
    ifs >> j;
    Map::MapData extractionMapData; // 抽出データ

    ExtractionMapData(j, extractionMapData);
}

//*---------------------------------------------------------------------------------------
//*【?】マップデータの抽出
//*
//* [引数]
//* _json   : 読み込んだjson
//*_outData : 出力データ
//*
//* [返値]
//* true : 成功
//* false : 失敗
//*----------------------------------------------------------------------------------------
bool MapManager::ExtractionMapData(const nlohmann::json& _json, Map::MapData& _outData)
{

}
