/* ◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇
// 
/* - @:定数バッファの定義ヘッダ - */
//
//  【?】定数バッファの定義してるよ(そのまんま)
// 
/* ◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇ */
#ifndef CONSTANT_BUFFERS_HLSLI
#define CONSTANT_BUFFERS_HLSLI

#include "Constants_H.hlsli"

//* =========================================================================
//* - @:ディレクションライト用構造体 - */
///* =========================================================================
struct DirectionalLightData
{
    float3 Direction;           // 方向
    float pad0;
    
    float3 DiffuseColor;        // ディフューズ
    float DiffuseIntensity;     // ディフューズ光度
    
    float3 SpecularColor;       // スペキュラ
    float SpecularIntensity;    // スペキュラ強度
    
    //float3 LightPos;            // ライトの位置（シャドウマップVSM用）
    //float pad1;
    
    float4x4 LightViewProj;     // ライトから見た画面座標
};

/* =========================================================================
//* - @:ポイントライト用構造体 - */
//* =========================================================================
struct PointLightData
{
    float3 Pos;                 // 座標   
    float Range;                // 範囲
    
    float3 DiffuseColor;        // ディフューズ
    float DiffuseIntensity;     // ディフューズ光度
    
    float3 SpecularColor;       // スペキュラ
    float SpecularIntensity;    // スペキュラ強度
};

/* =========================================================================
//* - @:スポットライト用構造体 - */
//* =========================================================================
struct SpotLightData
{
    float3 Pos;                 // 座標   
    float Range;                // 範囲
    
    float3 DiffuseColor;        // ディフューズ
    float DiffuseIntensity;     // ディフューズ光度
    
    float3 SpecularColor;       // スペキュラ
    float SpecularIntensity;    // スペキュラ強度
    
    float3 Direction;           // 放射する方向
    float Angle;                // 射出角度
};

/* =========================================================================
//* - @:被写界深度用構造体 - */
//* =========================================================================
struct DofData
{
    float MaxRange; // ぼかしが最大になる距離
    float MinRange; // ぼかしの開始距離
    float2 pad3;
};


/* =========================================================================
//* - @:フォグ用構造体 - */
//* =========================================================================
struct FogData
{
    float3 Color;
    float Start;

    float End;
    float3 padding;
};

/* =========================================================================
//* - @:色味調整用構造体 - */
//* =========================================================================
struct ColorGradingData
{
    float Exposure;     // 露出補正（1.0fで補正なし）
    float Contrast;     // コントラスト（1.0fで補正なし）
    float Saturation;   // 彩度（1.0fで補正なし）
    float Gamma;        // ガンマ補正（1.0fで補正なし）
    
    float3 ColorTint;   // 色味（1.0fで補正なし）
    float padding;
};

//////////////////////////////////////////////////////////////////////////////////////////
//
//
//						定数バッファの定義
// 
//
//////////////////////////////////////////////////////////////////////////////////////////

//* =========================================================================
//*- @:ワールド変換 -                           >>>>>>>【０】
//* =========================================================================
cbuffer CB_TRANSFORM : register(b0) 
{
    float4x4 cb_Transform;
};


//* =========================================================================
//*- @:ビュー変換 -                             >>>>>>>【１】
//* =========================================================================
cbuffer CB_VIEW : register(b1)   
{
    float4x4 cb_View;
    float4x4 cb_ViewProjInvMatrix; // ビュープロジェクション行列の逆行列。
};


//* =========================================================================
//*- @:投影（プロジェクション）変換用行列 -       >>>>>>>【２】 
//* =========================================================================
cbuffer CB_PROJECTION : register(b2)         
{
    float4x4 cb_Projection; // 透視投影
    float4x4 cb_ProjectionInv;  // 逆行列
    float4x4 cb_OrthographicProjection; // 正射投影（平行投影）
};


//* =========================================================================
//*- @:スキニング用ボーン行列群 -                 >>>>>>>【３】
//* =========================================================================
cbuffer CB_Bones : register(b3)               
{
    float4x4 cb_BoneMatrices[128]; // ボーン行列
};


//* =========================================================================
//*- @:マテリアル -                               >>>>>>>【４】
//* =========================================================================
cbuffer CB_MATERIAL : register(b4)        
{ // スロット4マテリアル
    float4 cb_DiffuseColor;                 // ディフューズカラー
    
    float4 cb_SpecularColor;                // スペキュラカラー
    
    float cb_SpecularPower;                 // スペキュラの強さ
    float cb_EmissivePower;                 // エミッシブの強さ
    float2 cb_OffsetUV;                     // UVオフセット
    
    float3 cb_EmissiveColor;                // エミッシブカラー
    float cb_EnvironmentReflectionStrength; // 環境反射の強さ
    
    //float2 pad0;
    // 16バイト境界調整（シェーダは16バイトが都合がいいらしい 上のfloatといい感じに合わせるため float3）
    // 追記:HLSLでは定数バッファの値が16の倍数のアドレスに格納されるらしい。
    //      c++側では4の倍数アドレスに配置されるためアクセスする際にアドレスの場所がずれ、間違った場所にアクセスしてしまう。
    //      なので16の倍数になるよう調整するために、パンディングが必要。
};


cbuffer CB_LIGHT : register(b5)
{
    /* ディレクションライト */
    DirectionalLightData cb_DirLightData[DIRECTIONLIGHT_MAX_NUM];
    
    /* ポイントライト */
    PointLightData cb_PointLightData[POINTLIGHT_MAX_NUM]; // 100個
    
    /* スポットライト */
    SpotLightData cb_SpotLightData[SPOTLIGHT_MAX_NUM];  // 20個
    
    uint cb_PointLightCount; // ポイントライトの数
    uint cb_SpotLightCount; // スポットライトの数
    float pad1;
    float pad2;
    float3 cb_EyePos; // 視点位置
    float pad3;
}

////* =========================================================================
////*- @:ディレクションライト -                     >>>>>>>【５】
////* =========================================================================
//cbuffer CB_DIRECTIONAL_LIGHT : register(b5)
//{
//    DirectionalLightData cb_DirLightData[DIRECTIONLIGHT_MAX_NUM];
    
//    float3 cb_EyePos; // 視点位置
//    float pad1;
//};


////* =========================================================================
////*- @:ポイントライト -                           >>>>>>>【６】
////* =========================================================================
//cbuffer CB_POINT_LIGHT : register(b6)        
//{
//    PointLightData cb_PointLightData[POINTLIGHT_MAX_NUM]; // 50個
//    uint cb_PointLightCount; // ポイントライトの数
//    float3 pad2;
//};

//* =========================================================================
//*- @:ブラー用 -                           >>>>>>>【６】
//* =========================================================================
cbuffer CB_BLUR_WEIGHTS : register(b6)
{
    float4 cb_BlurWeights[2];
};

//* =========================================================================
//*- @:ポストエフェクト用データ -            >>>>>>>【７】
//* =========================================================================
cbuffer CB_POSTEFFECT : register(b7)
{
    DofData cb_Dof;                     // 被写界深度
    ColorGradingData cb_ColorGrading;   // 色味調整用    
    FogData cb_Fog;                     // フォグ
};

//* =========================================================================
//*- @:シャドウ用データ -            >>>>>>>【８】
//* =========================================================================
cbuffer CB_SHADOW : register(b8)
{
    /* シャドウバイアス */
    float cb_BaseShadowBias;  
    float cb_SlopeScaledBias; 
    float cb_DepthBiasClamp;  
    bool cb_EnableShadow; // シャドウの有効/無効
};

//* =========================================================================
//*- @:スプライト用データ -            >>>>>>>【９】
//* =========================================================================
cbuffer CB_SPRITE : register(b9)
{
    float2 cb_Sprite_OffsetUV; // UVオフセット
    float pad4;
    float pad5;
};


//* =========================================================================
//*- @:デカール書き込み用データ -            >>>>>>>【１０】
//* =========================================================================
cbuffer CB_DECAL : register(b10)
{
    float4x4 cb_InvDecalTransform;  // デカールボックスのワールド逆行列
    float3 cb_DecalColor;   // カラー（float4にしてaにディザリングのしきい値入れてもいいかも）
    float pad6;
};

//* =========================================================================
//*- @:ウインドウ用データ -            >>>>>>>【１１】
//* =========================================================================
cbuffer CB_WINDOW : register(b11)
{
    float cb_WindowWidth; // ウインドウの幅
    float cb_WindowHeight; // ウインドウの高さ
    float2 pad7;
};


//* =========================================================================
//*- @:ディストーション用データ -        >>>>>>>【１２】
//* =========================================================================
cbuffer CB_DISTORTION : register(b12)
{
    float cb_DistortionPower;       // ディストーションの強さ
    float cb_DistortionTime;        // ディストーションの時間（アニメーション用）
    float2 cb_Distortion_UVScale;   // ディストーションのUVスケール
};

//* =========================================================================
//*- @:毎フレーム変わる用データ -        >>>>>>>【１３】
//* =========================================================================
cbuffer CB_FRAME : register(b13)
{
    float cb_Time;
    float cb_DeltaTime;
    float2 pad8;
};

#endif