// \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//
/* - @:頂点シェーダ -*/
//
//
//  【?】水面用
//
// \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#pragma once
#include "ConstantBuffers_H.hlsli"  // 共通ヘッダー


/* =========================================================================
/* - @:入力構造体 - */
/* =========================================================================*/
struct VS_INPUT
{
    float3 Pos : POSITION;
    float2 UV : TEXCOORD;
};

/* =========================================================================
/* - @:出力構造体 - */
/* =========================================================================*/
struct VS_OUTPUT
{
    float4 Pos      : SV_Position;
    float2 UV       : TEXCOORD0;
    float ViewDepth : TEXCOORD1;
};

// **************************************************************************
/* - @:エントリーポイント - */
// **************************************************************************
VS_OUTPUT VSMain(VS_INPUT input)
{
    VS_OUTPUT output;
    float4 pos = float4(input.Pos, 1.0f);
    
    pos = mul(pos, cb_Transform);   // ワールド変換（ワールド空間）
    pos = mul(pos, cb_View);        // ビュー変換（ビュー空間）
    
    output.ViewDepth = pos.z;       // ビュー空間の深度
    
    pos = mul(pos, cb_Projection);  // 投影変換（クリッピング空間）
    
    output.Pos = pos;       // 画面空間の頂点座標
    output.UV = input.UV;   // テクスチャ座標
    
    return output;
}